<?php
require __DIR__ . DIRECTORY_SEPARATOR . '..' . DIRECTORY_SEPARATOR . 'OHPGen' . DIRECTORY_SEPARATOR . 'header.php';
use \Core\Slides;

// 早禱
//(new Slides\Worship($ppt, '06_在祢呼召之地.ini'))->add();

// pw
(new Slides\Worship($ppt, '09_這是耶和華所定日子.ini'))->add();
(new Slides\Worship($ppt, '03_在這裡.ini'))->add();
(new Slides\Worship($ppt, '07_你神蹟如此真實.ini'))->add();
(new Slides\Worship($ppt, '06_在祢呼召之地.ini'))->add();
// 主日
(new Slides\Opening($ppt))->add(); // 關手機
(new Slides\Hymn($ppt, 192))->add(); // 唱詩
(new Slides\Verse($ppt, '約', 6, 51, 68))->add(); // 讀經
(new Slides\Hymn($ppt, 275))->add(); // 唱詩
(new Slides\ApostlesCreed($ppt))->add(); // 認信
(new Slides\GroupWorship($ppt, '腓利'))->add(); // 獻詩
(new Slides\Preach( // 講道
    $ppt,
    '門徒與會友',
    '陳小冬牧師',
    array(
        new Slides\Verse($ppt, '約', 6, 51, 68), // 讀經
    ), // 序言
    array(
        '門徒是來拜師學藝–會友是來為得利益' => array(
            new Slides\Verse($ppt, '約', 6, 59, 66), // 讀經		
            new Slides\Verse($ppt, '約', 6, 16, 27), // 讀經		
		),
        '拜師學藝精益求精–為得利益慾望漸高' => array(
            new Slides\Verse($ppt, '約', 6, 51, 57), // 讀經
        ),
        '精益求精青出於藍–慾望越高怨言不少得賜福' => array(
            new Slides\Verse($ppt, '約', 6, 67, 71), // 讀經
            new Slides\Verse($ppt, '太', 16, 13, 19), // 讀經
        ),
    )
))->add();
(new Slides\Tithing($ppt))->add(); // 奉獻
(new Slides\Visitor($ppt))->add(); // 新朋友
(new Slides\Report(
    $ppt,
    array(
        '我們誠心歡迎初次參加本教會敬拜的朋友。請留下姓名、地址、讓我們關心您，並邀請您參加各團契讀經小組、禱告會。',
		'下主日將有聖洗禮，目前已報名受洗的新肢體：張雯、蔡馠娜，願意受洗歸入主名下者，請向陳牧師報名。另外，每週主日（除了每個月第2個主日以外）早上9：00在副堂教室，陳牧師將為已經受洗的初信者、即將受洗歸入主名下的人或希望對福音有更多認識的新朋友開談道班，歡迎大家踴躍參加。',
		'下主日為聖餐主日，請弟兄姊妹預備心領受主的聖餐，並紀念主耶穌的救贖宏恩。',
		'下主日將召開九月份的同工會，請長老、執事、牧區長、團契輔導、會長與各讀經小組的組長於下主日愛筵後儘快到主堂開會。',
		'下一季10~12月服事表在編排中，請各牧區長、團契輔導、會長務必將下一季服事表於本週四(8月31日)前交給康長老。',
		'神學課程消息:恩道潛能開發學校將於9月10日 (主日)下午1:45開「講道法(一) 」密集課程，陳牧師將親自授課，尤其是團契的正副輔導、正副會長更鼓勵要來上課，以為團契擴張成牧區預備，沒上過講道法的弟兄姊妹，也歡迎來上課(曾經上過的歡迎來複習，免收學費)。',
		'2018年第30屆亞細亞聖徒訪韓聖會將在5月15日到5月19日舉行，地點在首爾汝夷島基督教中央純福音教會，明年聖會型式是5天的特會，請在招待處領取報名表，向顏長老報名及每位繳200元訂金，目前報名熱烈，請參加者儘速繳交報名表並以確實繳交200元訂金者為優先，請大家儘速報名，以提早預訂住宿與相關行程。',
		'教會為了購回建堂認股人，手中所持有的土地認購的股份，全部收歸教會所有，以利教會永續發展。經董事會和長執會的決議: 發起建堂奉獻。請主內弟兄姊妹(限已受洗的基督徒)，憑著信心簽立  「基督教恩道會教會建堂購地認獻立約書」，請大家注意以下幾點:
(1)奉獻起訖日期:請儘量填入2017年至2021年(每月固定奉獻)。
(2)奉獻金額多寡:完全不限，但請每位弟兄姊妹都能憑著信心簽立，並務必在「認獻人」欄位簽名。
(3)傳達正確訊息: 真正了解認獻的意義，乃是支持教會永續發展。
(4)在填寫奉獻袋時，請註明「購地認獻」，以方便會計部門作業。簽好之後請交給各團契輔導，再交由顏長老統計之。',
		'青年聯合團契於本週六(9月2日)下午3:00為九月份的專題分享，講題:「與神親密關係」，歡迎弟兄姊妹參加。',
		'長執會消息:九月份長執會將於下週六 (9月9日)上午9:30改在黃金海岸教會舉行，請長執們預備心出席，如有困難，請先提出，也請弟兄姊妹為布里斯本與黃金海岸教會的長執同工代禱。',
		'教會8~9月福音隊的服事表已公佈在佈告欄，每週六早上10:30在Sunnypark集合，請團契輔導注意服事日期，鼓勵大家踴躍參加。',
		'母堂9~10月主日午餐廚房事工，由腓利團契負責服事。',
		'雙語堂場地將於九月全面開始屋頂的整修工程，因此整個九月，雙語堂弟兄姐妹將回到母堂聚會，請大家相互通知。',
    )
))->add();
(new Slides\Intercession( // 代禱
    $ppt,
    array(
        '為教會擴建工程所需的經費與後續施工的順利平安代禱。',
        '為教會各團契擴張為牧區所需的同工與信心的看見代禱。',
        '為郭曉真姊妹(Jessica)的身體早日康復代禱。',
    )
))->add();
(new Slides\Dedication( // 上週奉獻
    $ppt,
    '主日敬拜879.70；主日學21.80；週二禱告會86.80；週四禱告會300.60；週五西區團契 90.50；雙語堂主日敬拜669.05；雙語堂主日學21.60；週六聯合團契 57.55；西區主日敬拜269.95；',
    array(
        '什 一' => '胡羽恆 100; R&J Yen F/T 50; The Chen F/T 50; 陳亞萍 10; 鄭朝元 200; 曾奕智 100;黃隆聲夫婦 120; Jan & Nan 200; P.J 650; 康世興全家 100; I-en & Melissa 200; 黃耀群夫婦 100; 浣熊L. L. 100; C.V.J. 65; 鄭朝鴻全家 200; 結斯敏 15; 趙芯斕 330;謝坤儒&杜斯斯 160;宋瑞琪 120; 唐俊英 180; Ryan & Wendy 100; 謝帛翰H.H 300; 宋安琪 100; JHVR 100; 高橋利加 50; JPH 250; EN Liao 50; M & C 200; 阮俊韋 60; Yan 50; C.L 125; 李翔 30; 王維娜 100;K & Y 8000;',
        '感 恩' => '鄭次郎夫婦 20; Bright & Vivian 50; Gloria Chang 100; 姚堯全家 50; 阮俊韋 20; 姚堯 50;',
        '建 堂' => 'Fiona & Steve 200; Lee H.W 20; 蔡重良全家 120; 吳福瑞全家 50; 陳素嫻 & 李銘哲 100;',
        '宣 教' => '翁浩夫婦 200; Gloria Chang 50;',
        '購地認獻' => '陳小冬全家 300; The Chen F/T 50; 陳亞萍 10; C.V.J. 10; Brock全家 20; 主知名 50;謝坤儒&杜斯斯 40; Sophia Qin 120; 凃秀鴻夫婦 50; Gloria Chang 200; 謝帛翰H.H 100; Sam & Kelly 100;丁偉&張小琼 50; 宋安琪 20; 陳小喬 50; EN Liao 20; 黃金英 50; Nicholas Yim 10; 張紅蕾 50; 歐伊甸Cherry 20; 大雄Shaun 5; 周月霞 25; 黎滿香 5; Rachel Lin 100;張月美 25; 袁玲玲 100; 王維娜 50; 顧淑珍夫婦 20; Boaz Chen 5; Samuel Chen 10; Lydia Chen 10; 蔡尚恩 5;',
    )
))->add();

(new Slides\WeeklyVerse($ppt, '我們務要認識耶和華，竭力追求認識祂；祂出現確如晨光，祂必臨到我們像甘雨，像滋潤田地的春雨。', '何 6:3'))->add(); // 金句
(new Slides\Hymn($ppt, 276))->add(); // 唱詩
(new Slides\LordsPrayer($ppt))->add(); // 主禱文
(new Slides\Ending($ppt))->add(); // 結束

require __DIR__ . DIRECTORY_SEPARATOR . '..' . DIRECTORY_SEPARATOR . 'OHPGen' . DIRECTORY_SEPARATOR . 'footer.php';